[M_Orchid_PlotMission05 MissionDefinition]
MissionDescription="Scarlett knows where to find the final piece of Captain Blade's compass. She has told you that Herbert, a former crewman of hers who lives out in [place]the Rustyards[-place], is obsessed with lore surrounding the Treasure of the Sands. If you find him, she says, he'll be able to point you toward the last compass piece."
TurnInDescription="Now that you've met Herbert, he should be happy to point you toward the final piece of Captain Blade's compass! Probably."

[M_Orchid_PlotMission05:GetBoxSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Scarlett knows where to find the final piece of Captain Blade's compass. She has told you that Herbert, a former crewman of hers who lives out in [place]the Rustyards[-place], is obsessed with lore surrounding the Treasure of the Sands. If you find him, she says, he'll be able to point you toward the last compass piece. Scarlett has asked you to deliver a special gift to Herbert."
